{
  "meta.title": "Sidi Li's Resume",
  "meta.description": "",

  "hero.name": "I'm Sidi.",
  "hero.intro.1": "A ",
  "hero.intro.2": "seasoned iOS developer",
  "hero.intro.3": " with experience in ",
  "hero.intro.4": "Web development",
  "hero.intro.5": ", passionately curious about ",
  "hero.intro.6": "AR and AI technologies",
  "hero.intro.7": ". As a graduate student in ",
  "hero.intro.8": "Artificial Intelligence",
  "hero.intro.9": ", I am dedicated to integrating advanced technology with innovative thinking.",

  "hero.hobby.1": "In my spare time, ",
  "hero.hobby.2": "Animation, Comics, and Games ",
  "hero.hobby.3": "are my passions. I firmly believe that, whether it's creating virtual worlds or enriching real-life experiences, ",
  "hero.hobby.4": "technology and creativity",
  "hero.hobby.5": " can always forge new frontiers.",

  "about": "About",
  "contact": "Contact",
  "portfolio": "Portfolio",
  "resume": "Resume",
  "skills": "Skills",
  "stats": "Stats",
  "testimonials": "Testimonials",

  "about.title": "About Me",
  "about.description": "A seasoned iOS developer well-versed in web front-end, with a passion for AR and AI technologies. Currently pursuing a Master's in Artificial Intelligence, I am focused on blending technical expertise with innovative thinking, aspiring to leverage my substantial development experience and enthusiasm in the field of AI.",
  "about.label.location": "Location",
  "about.label.age": "Age",
  "about.label.nationality": "Nationality",
  "about.label.interests": "Interests",
  "about.label.study": "Study",
  "about.label.employment": "Employment",
  "about.location": "China, Shenzhen",
  "about.age": "31",
  "about.nationality": "China",
  "about.interests": "Video games, Traveling, Food",
  "about.study": "Illinois Institute of Technology/Master of Artificial Intelligence/Graduated in 2024",
  "about.employment": "NetDragon Websoft Inc, Breo Technology, etc.",

  "education.title": "Education",

  "education.iit.title": "Master of Artificial Intelligence",
  "education.iit.location": "Illinois Institute of Technology",
  "education.iit.date": "Spring 2024",
  "education.iit.content": "During my Master's in Artificial Intelligence, I delved into the core disciplines of AI, including Machine Learning, Deep Learning, Natural Language Processing, and the principles of databases. This academic journey has not only armed me with cutting-edge knowledge in AI technologies but also honed my ability to apply theoretical concepts in practical scenarios.",

  "education.scnu.title": "Bachelor of Physics",
  "education.scnu.location": "South China Normal University",
  "education.scnu.date": "July 2021",
  "education.scnu.content": "I specialized in Physics during my university studies, delving deeply into quantum mechanics, electrodynamics, and linear algebra. I also expanded my academic horizon with courses in education and educational psychology, aiming to integrate core scientific principles with effective teaching methodologies.",

  "work.title": "Work",
  "work.nd.title": "Senior Software Engineer",
  "work.nd.location": "NetDragon Websoft Holdings Limited",
  "work.nd.date": "April 2020 - February 2023",
  "work.nd.content": "- Work Content - \n1. Utilize front-end technologies such as React, TypeScript, and Node.js, collaborate with product managers and UX to develop and maintain high-performance Web applications.\n2. Responsible for front-end performance optimization, improve data processing efficiency with technology stacks like GraphQL.\n3. Develop iOS/Mac platform applications using Swift and Objective-C, and work with QA to optimize App performance.\n<br>\n- Work Achievements -\n1. Made significant contributions to the mobile Edmodo project, assisting the team in growing the application from its initial phase to 4 million daily active users.\n2. In the Polling project, I participated in the design and implementation of a voting system from scratch, which allows teachers to quickly initiate polls and view results in real time, effectively enhancing classroom interaction.\n3. In the NGLD project, developed a drawing whiteboard capable of collaborating with hardware, implemented functionalities through fabric.js, successfully ported this module to other projects to improve resource utilization, thereby doubling the whiteboard drawing performance.",

  "work.miaodou.title": "Senior iOS Engineer",
  "work.miaodou.location": "Miaodou Tech Ltd., Guangzhou",
  "work.miaodou.date": "August 2019 - March 2020",
  "work.miaodou.content": "- Work Content - \n1. Led the iOS underlying security enhancement project, designed and implemented code protection mechanisms to fortify the application against reverse engineering attacks.\n2. Responsible for the optimization and review-oriented tasks of iOS applications, ensuring efficient passage through the App Store review process.\n3. Developed and maintained SDKs as well as core native components, improving application performance and user experience.\n<br>\n- Work Achievements -\n1. Created and promoted a standard process for submitting iOS applications for review, significantly improving review pass rates and submission efficiency.\n2. Developed specialized tools to automate the preparation work before review, simplifying the review process and alleviating the workload of the development team.",

  "work.babyfs.title": "Senior iOS Engineer",
  "work.babyfs.location": "QiMeng Education Technology Ltd., Beijing",
  "work.babyfs.date": "January 2018 - June 2019",
  "work.babyfs.content": "- Work Content - \n1. Iterated iOS application versions based on the product manager's requirements, implementing the development of key new features.\n2. Integrated Cocos2dx module through Cocoapods, responsible for the access and maintenance of this game engine module, ensuring its stability and performance within the application.\n3. Participated in the design and development of Cocos mini-games, enhancing user interaction and application fun through gamification.\n<br>\n- Work Achievements -\n1. Played a key role in team collaboration, successfully integrated the cocos2dx module, enhancing the application's functionality and competitiveness.\n2. Through efficient collaboration and continuous technical contributions, helped the application to steadily maintain a top 5 ranking in the education sector best-selling list, showcasing the team's overall strength and high-quality product.",

  "work.breo.title": "iOS Engineer",
  "work.breo.location": "Breo Technology Co., Ltd., Shenzhen",
  "work.breo.date": "April 2016 - January 2018",
  "work.breo.content": "- Work Content - \n1. Independently developed the 'iHeart' application, utilizing camera technology for heart rate detection, providing a stable feature in the company's product line.\n2. Responsible for the iOS development of smart wearable projects, involving the use of iOS Bluetooth module for communication with smart devices, accumulating experience in Bluetooth communication development.\n3. Maintained and upgraded existing iOS applications, ensuring continuous optimization of product performance and user experience.\n4. Independently completed the development of the company's WeChat Mini Program, from conceptual design to product launch, fully mastering the development and operation process of WeChat Mini Programs.\n<br>\n- Work Achievements -\n1. Independently completed the development and listing of the App.\n2. Independently completed the development and launch of the WeChat Mini Program.\n3. Helped the company solve numerous technical challenges.",

  "mail.title": "Get in touch.",
  "mail.description": "You can send me a message directly, or contact me through the following methods:",
  "mail.success.tips": "Email sent successfully. I have received your email and will get back to you as soon as I review it. Thank you!",
  "mail.send.btn": "Send Message",
  "mail.placeholder.name": "Name",
  "mail.placeholder.mail": "Mail",
  "mail.placeholder.message": "Message"
}
