{
  "meta.title": "Sidi Li's Resume",
  "meta.description": "Meet Sidi Li, a highly skilled iOS developer based in China with a proven track record in AI and front-end web development. Known for seamless remote collaboration with international teams, Sidi brings unparalleled expertise and passion to every web project. Discover the value and innovation Sidi contributes to tech teams, transcending geographical boundaries for project success.",

  "hero.name": "I'm Sidi.",
  "hero.intro.1": "A ",
  "hero.intro.2": "seasoned iOS developer",
  "hero.intro.3": " with experience in ",
  "hero.intro.4": "Web development",
  "hero.intro.5": ", passionately curious about ",
  "hero.intro.6": "AR and AI technologies",
  "hero.intro.7": ". As a graduate student in ",
  "hero.intro.8": "Artificial Intelligence",
  "hero.intro.9": ", I am dedicated to integrating advanced technology with innovative thinking.",

  "hero.hobby.1": "In my spare time, ",
  "hero.hobby.2": "Animation, Comics, and Games ",
  "hero.hobby.3": "are my passions. I firmly believe that, whether it's creating virtual worlds or enriching real-life experiences, ",
  "hero.hobby.4": "technology and creativity",
  "hero.hobby.5": " can always forge new frontiers.",

  "hero.notes": "Most of the materials on this site were created using generative artificial intelligence, including this note. My personal image was crafted by the LoRA model, which I trained independently.",

  "about": "About",
  "contact": "Contact",
  "portfolio": "Portfolio",
  "resume": "Resume",
  "skills": "Skills",
  "stats": "Stats",
  "testimonials": "Testimonials",

  "about.title": "About Me",
  "about.description": "A seasoned iOS developer well-versed in web front-end, with a passion for AR and AI technologies. Currently pursuing a Master's in Artificial Intelligence, I am focused on blending technical expertise with innovative thinking, aspiring to leverage my substantial development experience and enthusiasm in the field of AI.",
  "about.label.location": "Location",
  "about.label.age": "Age",
  "about.label.nationality": "Nationality",
  "about.label.interests": "Interests",
  "about.label.study": "Study",
  "about.label.employment": "Employment",
  "about.location": "China, Shenzhen",
  "about.age": "31",
  "about.nationality": "China",
  "about.interests": "Video games, Traveling, Food",
  "about.study": "Illinois Institute of Technology/Master of Artificial Intelligence/Graduated in 2024",
  "about.employment": "NetDragon Websoft Inc, Breo Technology, etc.",

  "education.title": "Education",

  "education.iit.title": "Master of Artificial Intelligence",
  "education.iit.location": "Illinois Institute of Technology",
  "education.iit.date": "Spring 2024",
  "education.iit.content": "During my Master's in Artificial Intelligence, I delved into the core disciplines of AI, including Machine Learning, Deep Learning, Natural Language Processing, and the principles of databases. This academic journey has not only armed me with cutting-edge knowledge in AI technologies but also honed my ability to apply theoretical concepts in practical scenarios.",

  "education.scnu.title": "Bachelor of Physics",
  "education.scnu.location": "South China Normal University",
  "education.scnu.date": "July 2015",
  "education.scnu.content": "I specialized in Physics during my university studies, delving deeply into quantum mechanics, electrodynamics, and linear algebra. I also expanded my academic horizon with courses in education and educational psychology, aiming to integrate core scientific principles with effective teaching methodologies.",

  "work.title": "Work",
  "work.nd.title": "Senior Software Engineer",
  "work.nd.location": "NetDragon Websoft Holdings Limited",
  "work.nd.date": "April 2020 - February 2023",
  "work.nd.content": "- Work Content - \n1. Utilize front-end technologies such as React, TypeScript, and Node.js, collaborate with product managers and UX to develop and maintain high-performance Web applications.\n2. Responsible for front-end performance optimization, improve data processing efficiency with technology stacks like GraphQL.\n3. Develop iOS/Mac platform applications using Swift and Objective-C, and work with QA to optimize App performance.\n[newline]\n- Work Achievements -\n1. Made significant contributions to the mobile Edmodo project, assisting the team in growing the application from its initial phase to 4 million daily active users.\n2. In the Polling project, I participated in the design and implementation of a voting system from scratch, which allows teachers to quickly initiate polls and view results in real time, effectively enhancing classroom interaction.\n3. In the NGLD project, developed a drawing whiteboard capable of collaborating with hardware, implemented functionalities through fabric.js, successfully ported this module to other projects to improve resource utilization, thereby doubling the whiteboard drawing performance.",

  "work.miaodou.title": "Senior iOS Engineer",
  "work.miaodou.location": "Miaodou Tech Ltd., Guangzhou",
  "work.miaodou.date": "August 2019 - March 2020",
  "work.miaodou.content": "- Work Content - \n1. Led the iOS underlying security enhancement project, designed and implemented code protection mechanisms to fortify the application against reverse engineering attacks.\n2. Responsible for the optimization and review-oriented tasks of iOS applications, ensuring efficient passage through the App Store review process.\n3. Developed and maintained SDKs as well as core native components, improving application performance and user experience.\n[newline]\n- Work Achievements -\n1. Created and promoted a standard process for submitting iOS applications for review, significantly improving review pass rates and submission efficiency.\n2. Developed specialized tools to automate the preparation work before review, simplifying the review process and alleviating the workload of the development team.",

  "work.babyfs.title": "Senior iOS Engineer",
  "work.babyfs.location": "QiMeng Education Technology Ltd., Beijing",
  "work.babyfs.date": "January 2018 - June 2019",
  "work.babyfs.content": "- Work Content - \n1. Iterated iOS application versions based on the product manager's requirements, implementing the development of key new features.\n2. Integrated Cocos2dx module through Cocoapods, responsible for the access and maintenance of this game engine module, ensuring its stability and performance within the application.\n3. Participated in the design and development of Cocos mini-games, enhancing user interaction and application fun through gamification.\n[newline]\n- Work Achievements -\n1. Played a key role in team collaboration, successfully integrated the cocos2dx module, enhancing the application's functionality and competitiveness.\n2. Through efficient collaboration and continuous technical contributions, helped the application to steadily maintain a top 5 ranking in the education sector best-selling list, showcasing the team's overall strength and high-quality product.",

  "work.breo.title": "iOS Engineer",
  "work.breo.location": "Breo Technology Co., Ltd., Shenzhen",
  "work.breo.date": "April 2016 - January 2018",
  "work.breo.content": "- Work Content - \n1. Independently developed the 'iHeart' application, utilizing camera technology for heart rate detection, providing a stable feature in the company's product line.\n2. Responsible for the iOS development of smart wearable projects, involving the use of iOS Bluetooth module for communication with smart devices, accumulating experience in Bluetooth communication development.\n3. Maintained and upgraded existing iOS applications, ensuring continuous optimization of product performance and user experience.\n4. Independently completed the development of the company's WeChat Mini Program, from conceptual design to product launch, fully mastering the development and operation process of WeChat Mini Programs.\n[newline]\n- Work Achievements -\n1. Independently completed the development and listing of the App.\n2. Independently completed the development and launch of the WeChat Mini Program.\n3. Helped the company solve numerous technical challenges.",

  "skill.lan.title": "Spoken Languages",
  "skill.lan.1": "Mandarin",
  "skill.lan.2": "Cantonese",
  "skill.lan.3": "English",

  "skill.fe.title": "Frontend development",
  "skill.fe.1": "React",
  "skill.fe.2": "TypeScript",
  "skill.fe.3": "Next.JS",

  "skill.mobile.title": "Mobile development",
  "skill.mobile.1": "Swift",
  "skill.mobile.2": "Objective-C",
  "skill.mobile.3": "SwiftUI",

  "skill.ai.title": "Artificial Intelligence",
  "skill.ai.1": "Python",
  "skill.ai.2": "PyTorch",
  "skill.ai.3": "LangChain",

  "skill.aigc.title": "AIGC",
  "skill.aigc.1": "Prompt Engineering",
  "skill.aigc.2": "Stable Diffusion/Midjourney",
  "skill.aigc.3": "ChatGPT",

  "skill.xr.title": "XR Development",
  "skill.xr.1": "ARKit",
  "skill.xr.2": "Unity",

  "projects.title": "Check out some of my work",
  "projects.close": "Close",
  "projects.visit": "Visit Project",

  "projects.iheart.title": "iHeart",
  "projects.iheart.description": "My first independently developed iOS App",
  "projects.iheart.fullDescription": "iHeart is an iOS application that uses camera technology for heart rate monitoring. Users simply cover the camera with their finger, and iHeart calculates their heart rate using blood flow information captured by the camera.",
  "projects.iheart.role": "iOS Developer",
  "projects.iheart.duration": "April 2016 - September 2016",
  "projects.iheart.achievements": "Independently completed the app development and launch, solving numerous technical challenges for the company.",

  "projects.cowlevel.title": "CowLevel",
  "projects.cowlevel.description": "A well-known gaming community in China, I developed the iOS version in my spare time and helped launch it on the AppStore. It's a hybrid-developed iOS App",
  "projects.cowlevel.fullDescription": "A well-known gaming community in China, I independently developed the iOS version in my spare time and assisted with its AppStore launch. The app consists mainly of a large amount of gaming information, including features for posting, editing, and commenting. The main technical challenges were:\n1. Organizing extremely complex Feed stream information and considering how to display it without causing lag.\n2. Creating a custom rich text editor as open-source third-party rich text editors did not meet the requirements.\n3. Communicating detailed interactions with the Web side as some pages were web pages.",
  "projects.cowlevel.role": "Independent iOS Developer",
  "projects.cowlevel.duration": "December 2017 - July 2018",
  "projects.cowlevel.achievements": "In the CowLevel project, I applied advanced iOS development technology to successfully implement a high-performance application that includes rich gaming information and social features. I designed an efficient information feed system and independently developed a customized rich text editor to meet the unique needs of the community. My close collaboration with the Web team ensured seamless integration of web pages within the app, earning unanimous praise from community managers and users.",

  "projects.babyfs.title": "Baby English",
  "projects.babyfs.role": "Core Member of the iOS Development Team",
  "projects.babyfs.description": "A renowned educational product in China. I was a core developer during the iteration from early 2018 to mid-2019, experiencing its major version updates.",
  "projects.babyfs.fullDescription": "As a core developer, I participated in the version iteration from early 2018 to mid-2019, undergoing its major updates. My main responsibilities included:\n1. Writing the main module 'Learning Circle' in the form of a Feed stream within the app.\n2. Developing some of the mini-games within the app using CocosCreator+TypeScript.\n3. Integrating the Cocos2dx engine into our native project and managing and updating it with CocoaPods.\n4. Utilizing message forwarding to integrate JSBridge and Cocos messaging, creating a more unified bridge.\n5. Handling the integration of the customer service module in the app and managing it separately with CocoaPods.\n6. Iteration work on a large amount of basic business.",
  "projects.babyfs.duration": "January 2018 - June 2019",
  "projects.babyfs.achievements": "A perennial top 5 app on the AppStore's education charts, recommended by Apple.",

  "projects.soundbridge.title": "SoundBridge AI",
  "projects.soundbridge.role": "Front-end/Client-side Developer",
  "projects.soundbridge.description": "SoundBridge is an advanced application supporting iOS and Mac platforms, using high-level AI technology to transcribe audio into texts in various languages.",
  "projects.soundbridge.fullDescription": "SoundBridge is a cutting-edge app for iOS and Mac that uses AI to transcribe and translate audio into multiple languages, and vice versa. It features a user-friendly interface, high transcription accuracy, and natural-sounding audio outputs. Designed for multi-speaker content, it's ideal for podcasting. I leveraged SwiftUI for app development, ensuring seamless integration within the Apple ecosystem. For the web front-end, I utilized Next.js, TailwindCSS, and React for a contemporary, fluid experience. My role was pivotal in integrating advanced AI technologies, enhancing our product's intelligence and user engagement.",
  "projects.soundbridge.duration": "August 2023 - October 2023",
  "projects.soundbridge.achievements": "Our AI-powered SoundBridge app boasts over 90% accuracy in audio transcription and voice synthesis, thanks to advanced neural networks that have refined our language processing for both speed and precision. The natural quality of our voice outputs significantly boosts user experience. Recognized by platforms like AI FINDER, SoundBridge has earned acclaim for its market-leading innovation and technological excellence.",

  "projects.reviewhelper.title": "iOS Submission Assistance Tool",
  "projects.reviewhelper.role": "Desktop Development Engineer",
  "projects.reviewhelper.description": "A Python-developed iOS review assistant that allows apps to be submitted to the AppStore more standardly and conveniently",
  "projects.reviewhelper.fullDescription": "Drawing inspiration from various tools on the market, I have developed and maintained a set of customized tools in Python designed to enhance the security of iOS applications and ensure their smooth passage through Apple's review process. This toolkit not only improves the app structure to meet Apple's standards but also aids in effectively navigating iOS projects through the AppStore review, promptly identifying issues within iOS applications.",
  "projects.reviewhelper.duration": "August 2019 - Present",
  "projects.reviewhelper.achievements": "With meticulously designed strategies and intelligent tools, we have successfully overcome common obstacles in the App Store review process. This toolkit has enhanced code security and ensured compliance with application structure, significantly reducing the risk of rejection during the review. Following the implementation of this toolkit, there has been a notable increase in the pass rate, effectively shortening the time to market and enhancing the overall security and professional image of the applications.",

  "mail.title": "Get in touch.",
  "mail.description": "You can send me a message directly, or contact me through the following methods:",
  "mail.success.tips": "Email sent successfully. I have received your email and will get back to you as soon as I review it. Thank you!",
  "mail.send.btn": "Send Message",
  "mail.placeholder.name": "Your name",
  "mail.placeholder.mail": "Your mail",
  "mail.placeholder.message": "Message",

  "resume.link": "assets/en/resume.pdf",
  "contact.link": "#contact"
}
